In [1]:
import numpy as np
import pandas as pd

### 一.文件的读取和写入
1.文件读取   
pandas可以读取的文件格式有很多，这里主要介绍读取csv,excel,txt文件

In [2]:
df_csv = pd.read_csv('./ch2/my_csv.csv')
df_csv

   col1 col2  col3    col4      col5
0     2    a   1.4   apple  2020/1/1
1     3    b   3.4  banana  2020/1/2
2     6    c   2.5  orange  2020/1/5

In [4]:
df_txt = pd.read_table('./ch2/my_table.txt')
df_txt

   col1 col2  col3    col4      col5
0     2    a   1.4   apple  2020/1/1
1     3    b   3.4  banana  2020/1/2
2     6    c   2.5  orange  2020/1/5

In [6]:
df_excel = pd.read_excel('./ch2/my_excel.xlsx')
df_excel

   col1 col2  col3    col4      col5
0     2    a   1.4   apple  2020/1/1
1     3    b   3.4  banana  2020/1/2
2     6    c   2.5  orange  2020/1/5

这里有一些常用的公共参数,`header=None`表示第一行不作为列名,`index_col`表示把某一列或几列作为索引，索引的内容将会在第三章进行详述,`usecols`表示读取列的集合，默认读取所有的列,`parse_dates`表示需要转化为时间的列，关于时间序列的有关内容将在第十章讲解,`nrows`表示读取的数据行数。这些参数在上述三个函数里都可以使用。

In [7]:
pd.read_table('./ch2/my_table.txt', header=None)

      0     1     2       3         4
0  col1  col2  col3    col4      col5
1     2     a   1.4   apple  2020/1/1
2     3     b   3.4  banana  2020/1/2
3     6     c   2.5  orange  2020/1/5

In [8]:
pd.read_csv('./ch2/my_csv.csv', index_col=['col1','col2'])

           col3    col4      col5
col1 col2
2    a      1.4   apple  2020/1/1
3    b      3.4  banana  2020/1/2
6    c      2.5  orange  2020/1/5

In [9]:
pd.read_table('./ch2/my_table.txt', usecols = ['col1','col2'])

   col1 col2
0     2    a
1     3    b
2     6    c

In [10]:
pd.read_csv('./ch2/my_csv.csv', parse_dates=['col5'])

   col1 col2  col3    col4       col5
0     2    a   1.4   apple 2020-01-01
1     3    b   3.4  banana 2020-01-02
2     6    c   2.5  orange 2020-01-05

In [11]:
pd.read_excel('./ch2/my_excel.xlsx', nrows = 2)

   col1 col2  col3    col4      col5
0     2    a   1.4   apple  2020/1/1
1     3    b   3.4  banana  2020/1/2

在读取`txt`文件时，经常遇到分隔符非空格的情况，`read_table`有一个分割参数`sep`,它使得用户可以自定义分割符号,进行`txt`数据的读取。例如，下面的读取的表以`||||`为分割：

In [12]:
pd.read_table('./ch2/my_table_special_sep.txt')

              col1 |||| col2
0  TS |||| This is an apple.
1    GQ |||| My name is Bob.
2         WT |||| Well done!

上面的结果显然不理想，这时可以使用`sep`，同时需要指定引擎为`python`:

In [19]:
pd.read_table('./ch2/my_table_special_sep.txt', sep=' \|\|\|\| ', engine= 'python')

<>:1: SyntaxWarning: invalid escape sequence '\|'
<>:1: SyntaxWarning: invalid escape sequence '\|'
C:\Users\24153\AppData\Local\Temp\ipykernel_10372\575847930.py:1: SyntaxWarning: invalid escape sequence '\|'
  pd.read_table('./ch2/my_table_special_sep.txt', sep=' \|\|\|\| ', engine= 'python')

  col1               col2
0   TS  This is an apple.
1   GQ    My name is Bob.
2   WT         Well done!

[WARNING] `sep`是正则参数   
在使用`read_table`的时候需要注意，参数`sep`中使用的是正则表达式，因此需要对`|`进行转义变成`\|`,否则无法读取到正确的结果。

2.数据写入   
一般在数据写入中，最常用的操作是把`index`设置为`False`,特别当索引没有特殊意义的时候，这样的行为能把索引在保存的时候去除。

In [20]:
df_csv.to_csv('./ch2/my_csv_saved.csv', index = False)
df_excel.to_excel('./ch2/my_excel_saved.xlsx', index = False)

`pandas`中没有定义`to_table`函数，但是`to_csv`可以保存为`txt`文件，并且允许自定义分隔符，常用制表符`\t`分割：

In [21]:
df_txt.to_csv('./ch2/my_txt_saved.txt', sep = '\t', index = False)

如果想要把表格快速转换为`markdown`和`latex`语言，可以使用`to_markdown`和`to_latex`函数，此处需要安装`tabulate`包

In [22]:
print(df_csv.to_markdown())

|    |   col1 | col2   |   col3 | col4   | col5     |
|---:|-------:|:-------|-------:|:-------|:---------|
|  0 |      2 | a      |    1.4 | apple  | 2020/1/1 |
|  1 |      3 | b      |    3.4 | banana | 2020/1/2 |
|  2 |      6 | c      |    2.5 | orange | 2020/1/5 |

In [23]:
print(df_csv.to_latex())

\begin{tabular}{lrlrll}
\toprule
 & col1 & col2 & col3 & col4 & col5 \\
\midrule
0 & 2 & a & 1.400000 & apple & 2020/1/1 \\
1 & 3 & b & 3.400000 & banana & 2020/1/2 \\
2 & 6 & c & 2.500000 & orange & 2020/1/5 \\
\bottomrule
\end{tabular}

### 二.基本数据结构
`pandas`中具有两种基本的数据存储结构，存储一维`values`的`Serires`和存储二维`values`的`DataFrame`，在这两种结构上定义了很多的属性和方法。

1.Series
`Series`一般由四个部分组成，分别是序列的值`data`、索引`index`、存储类型`dtype`、序列的名字`name`。其中，索引也可以指定它的名字，默认为空。

In [24]:
s = pd.Series(data = [100, 'a', {'dic1':5}],
              index = pd.Index(['id1', 20, 'third'], name = 'my_idx'),
              dtype = 'object',
              name = 'my_name')
s

my_idx
id1              100
20                 a
third    {'dic1': 5}
Name: my_name, dtype: object

[NOTE] `object`类型    
`object`代表了一种混合类型，正如上面的例子中存储了整数、字符串以及`Python`的字典数据结构。此外，目前`pandas`把纯字符串序列也默认认为是一种`object`类型的序列，但它也可以用`string`类型存储，文本序列的内容会在第八章讨论。   
[END]   
对于这些属性，可以通过`.`的方式获取：

In [25]:
s.values

array([100, 'a', {'dic1': 5}], dtype=object)

In [26]:
s.index

Index(['id1', 20, 'third'], dtype='object', name='my_idx')

In [27]:
s.dtype

dtype('O')

In [28]:
s.name

'my_name'

利用`.shape`可以获取序列的长度：

In [29]:
s.shape

(3,)

2.DataFrame    
`DataFrame`在`Series`的基础上增加了列索引，一个数据框可以由二维的`data`与行列索引来构造：

In [32]:
data = [[1, 'a', 1.2], [2, 'b', 2.2], [3, 'c', 3.2]]
df = pd.DataFrame(data = data,
                  index = pd.Index(['row_%d' %i for i in range(3)]),
                  columns = pd.Index(['col_0', 'col_1', 'col_2']))
df

       col_0 col_1  col_2
row_0      1     a    1.2
row_1      2     b    2.2
row_2      3     c    3.2

但一般而言，更多的时候会采用从列索引名到数据的映射来构造数据框，同时再加上行索引：

In [33]:
df = pd.DataFrame(data = {'col_0':[1,2,3],
                          'col_1':list('abc'),
                          'col_2':[1.2,2.2,3.2]},
                    index = ['row_%d' % i for i in range(3)])
df

       col_0 col_1  col_2
row_0      1     a    1.2
row_1      2     b    2.2
row_2      3     c    3.2

由于这种映射关系，在`DataFrame`中可以用`[col_name]`与`[col_list]`来取出相应的列与由多个组成的表，结果分别为`Series`和`DataFrame`：

In [34]:
df['col_0']

row_0    1
row_1    2
row_2    3
Name: col_0, dtype: int64

In [36]:
df[['col_0','col_1']]

       col_0 col_1
row_0      1     a
row_1      2     b
row_2      3     c

与`Series`类似,在数据框中同样可以取出相应的属性：

In [37]:
df.values

array([[1, 'a', 1.2],
       [2, 'b', 2.2],
       [3, 'c', 3.2]], dtype=object)

In [38]:
df.index

Index(['row_0', 'row_1', 'row_2'], dtype='object')

In [39]:
df.columns

Index(['col_0', 'col_1', 'col_2'], dtype='object')

In [41]:
df.dtypes    # 返回的是值为相应列数据类型的Series

col_0      int64
col_1     object
col_2    float64
dtype: object

In [42]:
df.shape

(3, 3)

通过`.T`可以把`DataFrame`进行转置:

In [43]:
df.T

      row_0 row_1 row_2
col_0     1     2     3
col_1     a     b     c
col_2   1.2   2.2   3.2

### 三. 常用基本函数
为了进行举例说明，在接下来的部分和其余章节都将会使用一份`learn_pandas.csv`的虚拟数据集，它记录了四所学校学生的体测个人信息。

In [44]:
df = pd.read_csv('./learn_pandas.csv')
df.columns

Index(['School', 'Grade', 'Name', 'Gender', 'Height', 'Weight', 'Transfer',
       'Test_Number', 'Test_Date', 'Time_Record'],
      dtype='object')

上述列名依次代表学校、年级、姓名、性别、身高、体重、是否为转系生、体测场次、测试时间、1000米成绩，本章只需使用其中的前七列。

In [45]:
df = df[df.columns[:7]]

1.汇总函数
`head, tail`函数分别表示返回表或者序列的前`n`行和后`n`行，其中`n`默认为5:

In [46]:
df.head(2)

  School     Grade            Name  Gender  Height  Weight Transfer
0      A  Freshman    Gaopeng Yang  Female   158.9    46.0        N
1      B  Freshman  Changqiang You    Male   166.5    70.0        N

In [47]:
df.tail(3)

    School      Grade            Name  Gender  Height  Weight Transfer
197      A     Senior  Chengqiang Chu  Female   153.9    45.0        N
198      A     Senior   Chengmei Shen    Male   175.3    71.0        N
199      D  Sophomore     Chunpeng Lv    Male   155.7    51.0        N

`info, describe`分别返回表的信息概况和表中数值列对应的主要统计量:

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   School    200 non-null    object
 1   Grade     200 non-null    object
 2   Name      200 non-null    object
 3   Gender    200 non-null    object
 4   Height    183 non-null    float64
 5   Weight    189 non-null    float64
 6   Transfer  188 non-null    object
dtypes: float64(2), object(5)
memory usage: 11.1+ KB

In [49]:
df.describe()

           Height      Weight
count  183.000000  189.000000
mean   163.218033   55.015873
std      8.608879   12.824294
min    145.400000   34.000000
25%    157.150000   46.000000
50%    161.900000   51.000000
75%    167.500000   65.000000
max    193.900000   89.000000

2. 特征统计函数
在`Series`和`DataFrame`上定义了许多统计函数，最常见的是`sum, mean, median, var, std, max, min`。例如，选出身高和体重列进行演示：

In [50]:
df_demo = df[['Height', 'Weight']]
df_demo.mean()

Height    163.218033
Weight     55.015873
dtype: float64

In [51]:
df_demo.max()

Height    193.9
Weight     89.0
dtype: float64

此外，需要介绍的是`quantile, count, idxmax`这三个函数，它们分别返回的是分位数，非缺失值个数，最大值对应的索引：

In [52]:
df_demo.quantile(0.75)

Height    167.5
Weight     65.0
Name: 0.75, dtype: float64

In [54]:
df_demo.count()

Height    183
Weight    189
dtype: int64

In [55]:
df_demo.idxmax() # idxmin是对应的函数

Height    193
Weight      2
dtype: int64

上面这些所有的函数，由于操作后返回的是标量，所以又称为聚合函数，它们有一个公共参数`axis`,默认为0代表逐列聚合，如果设置为1则表示逐行聚合：

In [56]:
df_demo.mean(axis=1).head()  # 在这个数据集上体重和身高的均值并没有意义

0    102.45
1    118.25
2    138.95
3     41.00
4    124.00
dtype: float64

### 3.唯一值函数   
对序列使用`unique`和`nunique`可以分别得到其唯一值组成的列表和唯一值的个数：

In [57]:
df['School'].unique()

array(['A', 'B', 'C', 'D'], dtype=object)

In [58]:
df['School'].nunique()

4

`value_counts`可以得到唯一值和其对应出现的频数：

In [61]:
df['School'].value_counts()

School
D    69
A    57
C    40
B    34
Name: count, dtype: int64

如果想要观察多个列组合的唯一值，可以使用`drop_duplicates`.其中关键的参数是`keep`,默认值`first`表示每个组合保留第一次出现的所在行，`last`表示保留最后一次出现的所在行,`False`表示把所有重复组合所在的行剔除。

In [62]:
df_demo = df[['Gender', 'Transfer', 'Name']]
df_demo.drop_duplicates(['Gender', 'Transfer'])

    Gender Transfer            Name
0   Female        N    Gaopeng Yang
1     Male        N  Changqiang You
12  Female      NaN        Peng You
21    Male      NaN   Xiaopeng Shen
36    Male        Y    Xiaojuan Qin
43  Female        Y      Gaoli Feng

In [63]:
df_demo.drop_duplicates(['Gender', 'Transfer'], keep='last')

     Gender Transfer            Name
147    Male      NaN        Juan You
150    Male        Y   Chengpeng You
169  Female        Y   Chengquan Qin
194  Female      NaN     Yanmei Qian
197  Female        N  Chengqiang Chu
199    Male        N     Chunpeng Lv

In [66]:
df_demo.drop_duplicates(['Name', 'Gender'], keep=False).head()  # 保留只出现过一次的性别和姓名组合

   Gender Transfer            Name
0  Female        N    Gaopeng Yang
1    Male        N  Changqiang You
2    Male        N         Mei Sun
4    Male        N     Gaojuan You
5  Female        N     Xiaoli Qian

In [67]:
df['School'].drop_duplicates()  # 在Series上也可以使用

0    A
1    B
3    C
5    D
Name: School, dtype: object

此外，`duplicated`和`drop_duplicates`的功能类似，但前者返回了是否为唯一值的布尔列表，其`keep`参数与后者一致。其返回的序列，把重复元素设为`True`，否则为`False`.    
`drop_duplicates`等价于把`duplicated`为`True`的对应行剔除。

In [ ]:
df_demo.duplicated(['Gender', 'Transfer']).head()

0    False
1    False
2     True
3     True
4     True
dtype: bool

In [79]:
df['School'].duplicated().head()  #在Series上也可以使用

0    False
1    False
2     True
3    False
4     True
Name: School, dtype: bool